checkout-service/stressTest.yml
config:
  target: "http://localhost:4003"
  phases:
    - duration: 60
      arrivalRate: 1
      name: "testing one user per second for 60 second"
    - pause: 10
    - duration: 60
      arrivalRate: 10
      name: "Ten users per second for 60 seconds"
    - pause: 10
    - duration: 60
      arrivalRate: 100
      name: "100 users per second for 60 seconds"
    - pause: 10
    - duration: 60
      arrivalRate: 1000
      name: "1000 users per second for 60 seconds"
  variables:
    productId:
      - "999"
      - "9999"
      - "99999"
      - "999999"
      - "9999999"
      - "888"
      - "8888"
      - "88888"
      - "888888"
      - "8888888"
scenarios:
  - name: "Retrieve product price and inventory"
    flow:
      - get:
          url: "/priceandinventory/id/{{ productId }}"


#  To run this stress test: $(npm bin)/artillery run stressTest.yml