checkout-service/stressTest.yml
config:
  target: "http://localhost:4003"
  processor: "stressTestFunctions.js"
  phases:
    - duration: 60
      arrivalRate: 100
      name: "testing 100 user per second for 60 second"
    - pause: 60
    - duration: 60
      arrivalRate: 200
      name: "200 users per second for 60 seconds"
    - pause: 60
    - duration: 60
      arrivalRate: 300
      name: "300 users per second for 60 seconds"
    - pause: 60
    - duration: 60
      arrivalRate: 400
      name: "400 users per second for 60 seconds"
scenarios:
  - name: "Retrieve product price and inventory and write a new product to the database"
    flow:
      - get:
          url: "/priceandinventory/id/9000000"
          beforeRequest: "generateURLwithProductId"
      - post:
          url: "/priceandinventory/id/createRecord"
          headers:
            Content-Type: "application/json"
          beforeRequest: "createRequestBody"


#  To run this stress test: $(npm bin)/artillery run stressTest.yml